n3tk0/ESP32_Logger/src/managers/ConfigManager.cpp
    if (config.hardware.wakeupMode != WAKEUP_GPIO_ACTIVE_HIGH &&
        config.hardware.wakeupMode != WAKEUP_GPIO_ACTIVE_LOW) {
        config.hardware.wakeupMode = WAKEUP_GPIO_ACTIVE_HIGH;
        changed = true;
    }

    if (isnan(config.flowMeter.pulsesPerLiter) || isinf(config.flowMeter.pulsesPerLiter) || config.flowMeter.pulsesPerLiter <= 0.0f) {
        config.flowMeter.pulsesPerLiter = 450.0f;
        changed = true;
    }

    if (isnan(config.flowMeter.calibrationMultiplier) || isinf(config.flowMeter.calibrationMultiplier) || config.flowMeter.calibrationMultiplier <= 0.0f) {
        config.flowMeter.calibrationMultiplier = 1.0f;
        changed = true;
    }

    return changed;
}

// ============================================================================
// DEVICE ID
// ============================================================================
String generateDeviceId() {
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char id[13];
    snprintf(id, sizeof(id), "%02X%02X%02X%02X", mac[2], mac[3], mac[4], mac[5]);
    return String(id);
}

// ============================================================================
// LOAD DEFAULTS
// ============================================================================
void loadDefaultConfig() {
    memset(&config, 0, sizeof(DeviceConfig));
    config.magic   = CONFIG_STRUCT_MAGIC;
    config.version = CONFIG_VERSION;

    String devId = generateDeviceId();
    strncpy(config.deviceId,   devId.c_str(), sizeof(config.deviceId) - 1);
    strncpy(config.deviceName, "Water Logger", sizeof(config.deviceName) - 1);
    config.forceWebServer       = false;
    config.resetBootCountAction = -1;

    // Theme
    config.theme.mode = THEME_AUTO;
    SAFE_STRCPY(config.theme.primaryColor,      "#275673");
    SAFE_STRCPY(config.theme.secondaryColor,    "#4a5568");
    SAFE_STRCPY(config.theme.accentColor,       "#3182ce");
    SAFE_STRCPY(config.theme.lightBgColor,           "#f0f2f5");
    SAFE_STRCPY(config.theme.lightTextColor,         "#2d3748");
    SAFE_STRCPY(config.theme.darkBgColor,            "#0f172a");
    SAFE_STRCPY(config.theme.darkTextColor,          "#e2e8f0");
    SAFE_STRCPY(config.theme.ffColor,           "#275673");
    SAFE_STRCPY(config.theme.pfColor,           "#7eb0d5");
    SAFE_STRCPY(config.theme.otherColor,        "#a0aec0");
    SAFE_STRCPY(config.theme.storageBarColor,   "#27ae60");
    SAFE_STRCPY(config.theme.storageBar70Color, "#f39c12");
    SAFE_STRCPY(config.theme.storageBar90Color, "#e74c3c");
    SAFE_STRCPY(config.theme.storageBarBorder,  "#cccccc");
    // Default to the on-device copy.  Strict CSP (script-src 'self') blocks
    // CDN, and we expect uPlot.iife.min.js (or .gz) to be in LittleFS, so
    // CDN mode is opt-in only — flipping it on also requires relaxing CSP,
    // which is a deliberate user choice.
    config.theme.chartSource      = CHART_LOCAL;
    SAFE_STRCPY(config.theme.chartLocalPath, "/uPlot.iife.min.js");
    config.theme.showIcons        = true;
    config.theme.chartLabelFormat = LABEL_DATETIME;

    // Datalog
    SAFE_STRCPY(config.datalog.prefix,      DEFAULT_DATALOG_PREFIX);
    SAFE_STRCPY(config.datalog.currentFile, "/datalog.txt");
    SAFE_STRCPY(config.datalog.folder,      "");
    config.datalog.rotation             = ROTATION_NONE;
    config.datalog.maxSizeKB            = 1024;
    config.datalog.maxEntries           = 10000;
    config.datalog.includeDeviceId      = false;
    config.datalog.timestampFilename    = true;
    config.datalog.dateFormat           = DATE_DDMMYYYY;
    config.datalog.timeFormat           = TIME_HHMMSS;
    config.datalog.endFormat            = END_TIME;
    config.datalog.volumeFormat         = VOL_L_COMMA;
    config.datalog.includeBootCount     = true;
    config.datalog.includeExtraPresses  = true;
    config.datalog.postCorrectionEnabled = true;
    config.datalog.pfToFfThreshold      = 4.5f;
    config.datalog.ffToPfThreshold      = 3.7f;
    config.datalog.manualPressThresholdMs = 500;

    // Flow meter
    config.flowMeter.pulsesPerLiter                = 450.0f;
    config.flowMeter.calibrationMultiplier         = 1.0f;
    config.flowMeter.testMode                      = false;
    config.flowMeter.blinkDuration                 = 250;

    // Hardware
    config.hardware.version            = CONFIG_VERSION;
    config.hardware.storageType        = STORAGE_LITTLEFS;
    config.hardware.wakeupMode         = WAKEUP_GPIO_ACTIVE_HIGH;
    config.hardware.pinWifiTrigger     = DefaultPins::WIFI_TRIGGER;
    config.hardware.pinWakeupFF        = DefaultPins::WAKEUP_FF;
    config.hardware.pinWakeupPF        = DefaultPins::WAKEUP_PF;
    config.hardware.pinFlowSensor      = DefaultPins::FLOW_SENSOR;
    config.hardware.pinRtcCE           = DefaultPins::RTC_CE;
    config.hardware.pinRtcIO           = DefaultPins::RTC_IO;
    config.hardware.pinRtcSCLK        = DefaultPins::RTC_SCLK;
    config.hardware.pinSdCS            = DefaultPins::SD_CS;
    config.hardware.pinSdMOSI         = DefaultPins::SD_MOSI;
    config.hardware.pinSdMISO         = DefaultPins::SD_MISO;
    config.hardware.pinSdSCK          = DefaultPins::SD_SCK;
    config.hardware.cpuFreqMHz        = 80;
    config.hardware.debugMode         = false;
    config.hardware.defaultStorageView = 0;
    config.hardware.debounceMs        = 100;

    // Network
    config.network.wifiMode      = WIFIMODE_AP;
    SAFE_STRCPY(config.network.apSSID,     DEFAULT_AP_SSID);
    SAFE_STRCPY(config.network.apPassword, DEFAULT_AP_PASSWORD);
    SAFE_STRCPY(config.network.ntpServer,  DEFAULT_NTP_SERVER);
    config.network.timezone     = 2;
    config.network.useStaticIP  = false;
    config.network.staticIP[0]  = 192; config.network.staticIP[1]  = 168;
    config.network.staticIP[2]  = 4;   config.network.staticIP[3]  = 100;
    config.network.gateway[0]   = 192; config.network.gateway[1]   = 168;
    config.network.gateway[2]   = 4;   config.network.gateway[3]   = 1;
    config.network.subnet[0]    = 255; config.network.subnet[1]    = 255;
    config.network.subnet[2]    = 255; config.network.subnet[3]    = 0;
    config.network.dns[0]       = 8;   config.network.dns[1]       = 8;
    config.network.dns[2]       = 8;   config.network.dns[3]       = 8;
    config.network.apIP[0]      = 192; config.network.apIP[1]      = 168;
    config.network.apIP[2]      = 4;   config.network.apIP[3]      = 1;
    config.network.apGateway[0] = 192; config.network.apGateway[1] = 168;
    config.network.apGateway[2] = 4;   config.network.apGateway[3] = 1;
    config.network.apSubnet[0]  = 255; config.network.apSubnet[1]  = 255;
    config.network.apSubnet[2]  = 255; config.network.apSubnet[3]  = 0;

    // Logger (v13 wide-CSV pipeline)
    config.logger.csvLoggingEnabled         = true;
    config.logger.aggregationIntervalSec    = 60;

    // Kindle dashboard (v14). The defaults ARE the design the page was tuned
    // at — nothing bold, the reader's own serif, every block shown — so a
    // device that has never visited the settings page renders exactly what
    // docs/KINDLE_DASHBOARD.md describes.
    config.kindle.face         = KFACE_BOOKERLY;
    config.kindle.faceCustom[0] = '\0';
    config.kindle.boldZones    = 0;
    config.kindle.showFlags    = KSHOW_ALL;
    config.kindle.clockStyle   = KCLOCK_PLAIN;
    config.kindle.lang         = KLANG_AUTO;   // as the firmware was built
    config.kindle.timeFormat   = KTIME_24;
    config.kindle.dateFormat   = KDATE_DAY_MONTH;
    config.kindle.pressureUnit = KPRESS_HPA;
    config.kindle.tempDecimals = 1;

    // v15 fields. Written out rather than left to the memset above, because
    // two of the sentinels are 0xFF: zero means "explicitly off" for
    // followData and clockPinRefresh, so a memset alone would make a
    // factory-reset device stop following the data instead of using the
    // built-in default.
    config.kindle.refreshSec      = 0;      // 0    → KINDLE_REFRESH_SEC
    config.kindle.followData      = 0xFF;   // 0xFF → KINDLE_FOLLOW_DATA
    config.kindle.clockPinRefresh = 0xFF;   // 0xFF → KINDLE_CLOCK_PIN_REFRESH
    config.kindle.fbinkResW       = 0;      // 0    → KINDLE_PAGE_W
    config.kindle.outdoorSensor[0] = '\0';  // ""   → KINDLE_OUTDOOR_SENSOR
    config.kindle.indoorSensor[0]  = '\0';  // ""   → KINDLE_INDOOR_SENSOR
    config.kindle.layoutMode       = KLAYOUT_AUTO;   // decide from the forecast
}

// ============================================================================
// MIGRATE
// ============================================================================
void migrateConfig(uint8_t fromVersion) {
    DBGF("Migrating config v%d -> v%d\n", fromVersion, CONFIG_VERSION);
    if (fromVersion > CONFIG_VERSION) {
        Serial.printf("[Config] WARN: config v%d > firmware v%d — resetting defaults\n", fromVersion, CONFIG_VERSION);
        applyDefaults();
        return;
    }
    if (fromVersion < 6) {
        SAFE_STRCPY(config.network.ntpServer, DEFAULT_NTP_SERVER);
        config.network.timezone = 2;
    }
    if (fromVersion < 10) {
        config.datalog.postCorrectionEnabled  = true;
        config.datalog.pfToFfThreshold        = 4.5f;
        config.datalog.ffToPfThreshold        = 3.7f;
        config.datalog.manualPressThresholdMs = 500;
    }
    if (fromVersion < 11) {
        config.theme.showIcons = true;
        config.theme.chartLabelFormat = LABEL_DATETIME;
    }
    if (fromVersion < 12) {
        config.hardware.defaultStorageView = 0;
        if (!strlen(config.network.apPassword)) SAFE_STRCPY(config.network.apPassword, DEFAULT_AP_PASSWORD);
    }
    if (fromVersion < 13) {
        // Wide-CSV pipeline introduced.  JsonLogger has been removed; sensor
        // data is now persisted as wide CSV.  Default the kill switch to ON so
        // existing devices keep logging on upgrade.  Fields live in the new
        // top-level LoggerConfig appended at the end of DeviceConfig.
        config.logger.csvLoggingEnabled         = true;
        config.logger.aggregationIntervalSec    = 60;
    }
    if (fromVersion < 14) {
        // The Kindle dashboard's appearance became a setting.  Every device
        // upgrading into v14 has been rendering the built-in design, so the
        // defaults are chosen to BE that design: the page must not change
        // appearance because the firmware learned it could.
        config.kindle.face          = KFACE_BOOKERLY;
        config.kindle.faceCustom[0] = '\0';
        config.kindle.boldZones     = 0;
        config.kindle.showFlags     = KSHOW_ALL;
        config.kindle.clockStyle    = KCLOCK_PLAIN;
        config.kindle.lang          = KLANG_AUTO;
        config.kindle.timeFormat    = KTIME_24;
        config.kindle.dateFormat    = KDATE_DAY_MONTH;
        config.kindle.pressureUnit  = KPRESS_HPA;
        config.kindle.tempDecimals  = 1;
    }
    if (fromVersion < 15) {
        // KindleConfig grew by 33 bytes: refresh cadence, the FBInk render
        // width, and the two sensor ids the dashboard reads.
        //
        // EVERY ONE OF THESE IS SET TO ITS "USE THE COMPILE-TIME DEFAULT"
        // SENTINEL, and the sentinels are not all zero. A device upgrading has
        // been rendering the built-in behaviour, and the upgrade must not
        // change it — but loadDefaultConfig() starts from a memset, so
        // followData and clockPinRefresh would arrive as 0, which means
        // "explicitly off" and not "unset". The page would quietly stop
        // following the data on every device that had never opened the
        // settings form.
        config.kindle.refreshSec      = 0;      // 0    → KINDLE_REFRESH_SEC
        config.kindle.followData      = 0xFF;   // 0xFF → KINDLE_FOLLOW_DATA
        config.kindle.clockPinRefresh = 0xFF;   // 0xFF → KINDLE_CLOCK_PIN_REFRESH
        config.kindle.fbinkResW       = 0;      // 0    → KINDLE_PAGE_W
        config.kindle.outdoorSensor[0] = '\0';  // ""   → KINDLE_OUTDOOR_SENSOR
        config.kindle.indoorSensor[0]  = '\0';  // ""   → KINDLE_INDOOR_SENSOR
        // WHAT THIS COSTS: the four cadence fields were carved out of
        // KindleConfig::reserved[] while the version byte still read 14, so a
        // device that ran that build may hold real choices in them at these
        // exact offsets — and a device that ran the build before it holds
        // zeros, where followData/clockPinRefresh == 0 means "explicitly off"
        // rather than "unset". Both files say version 14 and nothing in them
        // tells the two apart, so the sentinel wins: a reader loses a refresh
        // cadence they set once, instead of every earlier device silently
        // stopping following its data.
    }
    config.version = CONFIG_VERSION;
    config.hardware.version = CONFIG_VERSION;
    // migrate must run pre-task-init: fsMutex is nullptr here; saveConfig is safe but not locked.
    saveConfig();
}

// ============================================================================
// LOAD CONFIG
// ============================================================================
bool loadConfig() {
    // ── Mount LittleFS ────────────────────────────────────────────────────────
    // R12 / AUDIT 1.7: formatOnFail=FALSE. Previously a transient mount fault
    // silently nuked the partition. Now we keep the on-disk bytes intact and
    // let setup() trip safe mode + serve the failsafe UI so the user can
    // explicitly request a wipe via the "Format Filesystem" button.
    if (LittleFS.begin(false, "/littlefs", 10, "spiffs")) {
        littleFsAvailable = true;
    } else {
        Serial.println("[CFG] LittleFS mount failed – using hardcoded defaults");
        loadDefaultConfig();
        return false;
    }

    // ── Recover interrupted crash-safe write ─────────────────────────────────
    if (!LittleFS.exists(CONFIG_FILE) && LittleFS.exists("/config.tmp")) {
        Serial.println("[CFG] Recovering config from temp file");
        if (!LittleFS.rename("/config.tmp", CONFIG_FILE))
            Serial.println("[CFG] config.tmp recovery rename FAILED");
    } else if (LittleFS.exists("/config.tmp")) {
        LittleFS.remove("/config.tmp");   // stale temp, real file exists
    }

    // ── Open config file ──────────────────────────────────────────────────────
    File f = LittleFS.open(CONFIG_FILE, "r");
    if (!f || f.isDirectory()) {
        Serial.println("[CFG] No config file – using hardcoded defaults");
        if (f) f.close();
        loadDefaultConfig();
        saveConfig();
        return false;
    }

    size_t fileSize = f.size();

