n3tk0/ESP32_Logger/src/managers/ConfigManager.cpp
    // ── Guard: file must be non-empty and not absurdly large ─────────────────
    if (fileSize == 0 || fileSize > sizeof(DeviceConfig) * 2) {
        Serial.printf("[CFG] Bad file size %u – using hardcoded defaults\n", fileSize);
        f.close();
        // Transient fault (spurious size): boot on in-memory defaults but do NOT
        // overwrite the on-disk file, so a retry next boot can still recover it.
        loadDefaultConfig();
        return false;
    }

    // ── Exact-size read (current struct version) ──────────────────────────────
    if (fileSize == sizeof(DeviceConfig)) {
        DeviceConfig tmp;
        size_t got = f.read((uint8_t*)&tmp, sizeof(DeviceConfig));
        f.close();

        if (got != sizeof(DeviceConfig) || tmp.magic != CONFIG_STRUCT_MAGIC) {
            Serial.println("[CFG] Magic mismatch / short read – using hardcoded defaults");
            // Transient fault (short read / bad magic): boot on in-memory defaults
            // but do NOT overwrite the on-disk file, so a retry next boot can still
            // recover it.
            loadDefaultConfig();
            return false;
        }
        memcpy(&config, &tmp, sizeof(DeviceConfig));
    }

    // ── Smaller file: migration from older struct ─────────────────────────────
    else if (fileSize < sizeof(DeviceConfig)) {
        uint8_t* rawBuf = (uint8_t*)malloc(fileSize);
        if (!rawBuf) {
            Serial.println("[CFG] malloc failed – using hardcoded defaults");
            f.close();
            // Transient fault (RAM pressure, file intact): boot on in-memory
            // defaults but do NOT overwrite the on-disk file.
            loadDefaultConfig();
            return false;
        }

        size_t got = f.read(rawBuf, fileSize);
        f.close();

        uint32_t fileMagic = 0;
        if (got >= sizeof(uint32_t)) memcpy(&fileMagic, rawBuf, sizeof(uint32_t));

        if (got != fileSize || fileMagic != CONFIG_STRUCT_MAGIC) {
            free(rawBuf);
            Serial.println("[CFG] Corrupt file – using hardcoded defaults");
            // Transient fault (short read / bad magic): boot on in-memory defaults
            // but do NOT overwrite the on-disk file, so a retry next boot can still
            // recover it.
            loadDefaultConfig();
            return false;
        }

        // Reject unrecognised source versions — byte layouts before v6 differ.
        uint8_t rawVersion = (got >= 5) ? rawBuf[sizeof(uint32_t)] : 0;
        constexpr uint8_t KNOWN_MIGRATABLE[] = {6, 7, 8, 9, 10, 11, 12, 13, 14};
        bool versionKnown = false;
        for (uint8_t v : KNOWN_MIGRATABLE) {
            if (rawVersion == v) { versionKnown = true; break; }
        }
        if (!versionKnown) {
            Serial.printf("[CFG] Unknown source version %u — resetting to defaults\n", rawVersion);
            free(rawBuf);
            loadDefaultConfig();
            saveConfig();
            return true;
        }

        // Start from safe defaults then overlay whatever bytes we have
        loadDefaultConfig();

        size_t headerSize = offsetof(DeviceConfig, theme);
        if (headerSize <= fileSize)
            memcpy(&config, rawBuf, headerSize);

        #define SAFE_COPY(field) \
            if (offsetof(DeviceConfig, field) + sizeof(config.field) <= fileSize) \
                memcpy(&config.field, rawBuf + offsetof(DeviceConfig, field), sizeof(config.field)); \
            else if (offsetof(DeviceConfig, field) < fileSize) \
                memcpy(&config.field, rawBuf + offsetof(DeviceConfig, field), fileSize - offsetof(DeviceConfig, field))

        SAFE_COPY(theme);
        SAFE_COPY(datalog);
        SAFE_COPY(flowMeter);
        SAFE_COPY(hardware);
        SAFE_COPY(network);
        SAFE_COPY(logger);   // v13+; pre-v13 binaries fall through to defaults
        SAFE_COPY(kindle);   // v14+; pre-v14 binaries fall through to defaults

        #undef SAFE_COPY

        free(rawBuf);
        Serial.printf("[CFG] Migrated %u -> %u bytes\n",
                      (unsigned)fileSize, (unsigned)sizeof(DeviceConfig));
    }

    else {
        // fileSize > sizeof(DeviceConfig) — shouldn't happen, treat as corrupt
        f.close();
        Serial.println("[CFG] Oversized config file – using hardcoded defaults");
        // Transient fault (spurious size): boot on in-memory defaults but do NOT
        // overwrite the on-disk file, so a retry next boot can still recover it.
        loadDefaultConfig();
        return false;
    }

    // ── Version migration ─────────────────────────────────────────────────────
    if (config.version < CONFIG_VERSION) migrateConfig(config.version);

    // ── Sanitise wake pins ────────────────────────────────────────────────────
    if (sanitizeWakeConfig()) {
        Serial.println("[CFG] Wake pins invalid/duplicate – restored defaults");
        saveConfig();
    }

    // ── Null-termination guard on all critical char[] fields ─────────────────
    config.deviceName[sizeof(config.deviceName) - 1]                   = '\0';
    config.deviceId[sizeof(config.deviceId) - 1]                       = '\0';
    config.datalog.currentFile[sizeof(config.datalog.currentFile) - 1] = '\0';
    config.datalog.prefix[sizeof(config.datalog.prefix) - 1]           = '\0';
    config.datalog.folder[sizeof(config.datalog.folder) - 1]           = '\0';
    config.network.apSSID[sizeof(config.network.apSSID) - 1]           = '\0';
    config.network.apPassword[sizeof(config.network.apPassword) - 1]   = '\0';
    config.network.clientSSID[sizeof(config.network.clientSSID) - 1]   = '\0';
    config.network.clientPassword[sizeof(config.network.clientPassword) - 1] = '\0';
    config.network.ntpServer[sizeof(config.network.ntpServer) - 1]     = '\0';
    config.theme.primaryColor[sizeof(config.theme.primaryColor) - 1]   = '\0';
    config.theme.secondaryColor[sizeof(config.theme.secondaryColor) - 1] = '\0';
    config.theme.lightBgColor[sizeof(config.theme.lightBgColor) - 1]   = '\0';
    config.theme.lightTextColor[sizeof(config.theme.lightTextColor) - 1] = '\0';
    config.theme.darkBgColor[sizeof(config.theme.darkBgColor) - 1]     = '\0';
    config.theme.darkTextColor[sizeof(config.theme.darkTextColor) - 1] = '\0';
    config.theme.ffColor[sizeof(config.theme.ffColor) - 1]             = '\0';
    config.theme.pfColor[sizeof(config.theme.pfColor) - 1]             = '\0';
    config.theme.otherColor[sizeof(config.theme.otherColor) - 1]       = '\0';
    config.theme.storageBarColor[sizeof(config.theme.storageBarColor) - 1] = '\0';
    config.theme.storageBar70Color[sizeof(config.theme.storageBar70Color) - 1] = '\0';
    config.theme.storageBar90Color[sizeof(config.theme.storageBar90Color) - 1] = '\0';
    config.theme.storageBarBorder[sizeof(config.theme.storageBarBorder) - 1] = '\0';
    config.theme.chartLocalPath[sizeof(config.theme.chartLocalPath) - 1] = '\0';

